#### IMPORTACIÓN LIBRERÍAS

In [1]:
# Importamos sqlite3, la librería estándar de Python para trabajar con bases de datos SQLite
# SQLite es una base de datos embebida que no requiere servidor
import sqlite3

# Importamos datetime para trabajar con fechas y horas
# Esto nos permitirá registrar cuándo ocurren eventos (ej: fecha de registro de cliente)
from datetime import datetime

# Importamos pandas para visualizar mejor los resultados (opcional pero recomendado)
# Pandas nos permite mostrar los datos en formato tabla más legible
import pandas as pd

# Mensaje de confirmación para saber que todo se importó correctamente
print("Librerías importadas correctamente")

Librerías importadas correctamente

#### CONEXIÓN A BBDD

In [2]:
# Creamos la conexión a la base de datos
# sqlite3.connect() crea un archivo .db si no existe o se conecta a uno existente
# Si el archivo 'tienda_online.db' no existe, se creará automáticamente
conexion = sqlite3.connect('thebridge.db')

# Creamos un cursor, que es el objeto que usaremos para ejecutar comandos SQL
# El cursor es como un "puntero" que nos permite navegar y modificar la base de datos
cursor = conexion.cursor()

# Mensajes informativos para confirmar que la conexión fue exitosa
print("Conexión establecida exitosamente")
print(f"Base de datos: thebridge.db")

Conexión establecida exitosamente
Base de datos: thebridge.db

#### IMPORTAR CSV

In [3]:
df_clase1 = pd.read_csv("./data/clase_1.csv", sep=";")
df_clase2 = pd.read_csv("./data/clase_2.csv", sep=";")
df_clase3 = pd.read_csv("./data/clase_3.csv", sep=";")
df_clase4 = pd.read_csv("./data/clase_4.csv", sep=";")

df_alumnos_ds = pd.concat([df_clase1, df_clase2])
df_alumnos_fs = pd.concat([df_clase3, df_clase4])

df_alumnos = pd.concat([df_alumnos_ds, df_alumnos_fs])

df_claustro = pd.read_csv("./data/claustro.csv", sep=";")

In [4]:
df_alumnos_ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25 entries, 0 to 9
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Nombre               25 non-null     object
 1   Email                25 non-null     object
 2   Promoción            25 non-null     object
 3   Fecha_comienzo       25 non-null     object
 4   Campus               25 non-null     object
 5   Proyecto_HLF         25 non-null     object
 6   Proyecto_EDA         25 non-null     object
 7   Proyecto_BBDD        25 non-null     object
 8   Proyecto_ML          25 non-null     object
 9   Proyecto_Deployment  25 non-null     object
dtypes: object(10)
memory usage: 2.1+ KB

================================================================================================

#### CREACIÓN DE TABLAS DE DIMENSIONES

In [5]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS ALUMNOS')

cursor.execute('''
    CREATE TABLE ALUMNOS (
    AlumnoID INTEGER PRIMARY KEY AUTOINCREMENT,
    Nombre VARCHAR(255) NOT NULL,
    Email VARCHAR(255) UNIQUE NOT NULL
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla ALUMNOS creada exitosamente")

✓ Tabla ALUMNOS creada exitosamente

In [6]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS PROFESORES')


cursor.execute('''
    CREATE TABLE PROFESORES (
    ProfesorID INTEGER PRIMARY KEY AUTOINCREMENT,
    Nombre VARCHAR(255) NOT NULL,
    Rol VARCHAR(50), -- (TA, LI)
    Modalidad VARCHAR(50)
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla PROFESORES creada exitosamente")

✓ Tabla PROFESORES creada exitosamente

In [7]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS PROMOCION')

cursor.execute('''
    CREATE TABLE PROMOCION (
    PromocionID INTEGER PRIMARY KEY AUTOINCREMENT,
    Mes VARCHAR(50) NOT NULL, -- Ej: 'Septiembre', 'Febrero'
    Fecha_comienzo DATE NOT NULL
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla PROMOCION creada exitosamente")

✓ Tabla PROMOCION creada exitosamente

In [8]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS VERTICALES')


cursor.execute('''
    CREATE TABLE VERTICALES (
    VerticalID INTEGER PRIMARY KEY AUTOINCREMENT,
    Nombre VARCHAR(50) UNIQUE NOT NULL
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla VERTICALES creada exitosamente")

✓ Tabla VERTICALES creada exitosamente

In [9]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS CAMPUS')


cursor.execute('''
    CREATE TABLE CAMPUS (
    CampusID INTEGER PRIMARY KEY AUTOINCREMENT,
    Ciudad VARCHAR(50) NOT NULL -- Ej: 'Madrid', 'Valencia'
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla CAMPUS creada exitosamente")

✓ Tabla CAMPUS creada exitosamente

================================================================================================

#### CREACIÓN DE TABLA DEPENDIENTE

In [10]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS PROYECTOS')


cursor.execute('''
    CREATE TABLE PROYECTOS (
    ProyectoID INTEGER PRIMARY KEY AUTOINCREMENT,
    Nombre VARCHAR(100) NOT NULL,
    VerticalID INTEGER NOT NULL,
    -- FK: Un proyecto pertenece a una Vertical
    FOREIGN KEY (VerticalID) REFERENCES VERTICALES(VerticalID)
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla PROYECTOS creada exitosamente")

✓ Tabla PROYECTOS creada exitosamente

================================================================================================

#### CREACIÓN DE TABLA CENTRAL

In [11]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS CURSO')


cursor.execute('''
               --Define la instancia única del curso (QUÉ, CUÁNDO, DÓNDE).
    CREATE TABLE CURSO (
    CursoID INTEGER PRIMARY KEY AUTOINCREMENT,
    PromocionID INTEGER NOT NULL,
    VerticalID INTEGER NOT NULL,
    CampusID INTEGER NOT NULL,

    -- FKs a las Tablas de Dimensión
    FOREIGN KEY (PromocionID) REFERENCES PROMOCION(PromocionID),
    FOREIGN KEY (VerticalID) REFERENCES VERTICALES(VerticalID),
    FOREIGN KEY (CampusID) REFERENCES CAMPUS(CampusID)
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla CURSO creada exitosamente")

✓ Tabla CURSO creada exitosamente

================================================================================================

#### CREACIÓN DE TABLAS PUENTE

In [12]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS MATRICULAS')


cursor.execute('''
               --Resuelve la N:M entre ALUMNOS y CURSO.
    CREATE TABLE MATRICULAS (
    CursoID INTEGER NOT NULL,
    AlumnoID INTEGER NOT NULL,
    FechaInscripcion DATE,

    -- PK Compuesta: Un alumno se inscribe una sola vez por curso
    PRIMARY KEY (CursoID, AlumnoID),

    FOREIGN KEY (CursoID) REFERENCES CURSO(CursoID),
    FOREIGN KEY (AlumnoID) REFERENCES ALUMNOS(AlumnoID)
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla MATRICULAS creada exitosamente")

✓ Tabla MATRICULAS creada exitosamente

In [13]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS CURSO_PROFESOR')


cursor.execute('''
               --Resuelve la N:M entre PROFESORES y CURSO.
    CREATE TABLE CURSO_PROFESOR (
    CursoID INTEGER NOT NULL,
    ProfesorID INTEGER NOT NULL,
    RolEnCurso VARCHAR(50),

    -- PK Compuesta: Un profesor tiene una única asignación por curso
    PRIMARY KEY (CursoID, ProfesorID),

    FOREIGN KEY (CursoID) REFERENCES CURSO(CursoID),
    FOREIGN KEY (ProfesorID) REFERENCES PROFESORES(ProfesorID)
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla CURSO_PROFESOR creada exitosamente")

✓ Tabla CURSO_PROFESOR creada exitosamente

================================================================================================

#### CREACIÓN DE TABLA DE HECHOS

In [14]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS CALIFICACIONES')


cursor.execute('''
               --Registra la nota del proyecto.
    CREATE TABLE CALIFICACIONES (
    -- Estos campos forman la PK y la FK Compuesta a MATRICULAS
    CursoID INTEGER NOT NULL,
    AlumnoID INTEGER NOT NULL,
    ProyectoID INTEGER NOT NULL,

    -- La Nota utiliza VARCHAR(10) para almacenar 'Apto' o 'No Apto'
    Nota VARCHAR(10) NOT NULL, 
    FechaEvaluacion DATE,

    -- PK Compuesta: La nota es única para ese Alumno, Curso e Proyecto.
    PRIMARY KEY (CursoID, AlumnoID, ProyectoID),

    -- FK 1: Valida que el Proyecto existe
    FOREIGN KEY (ProyectoID) REFERENCES PROYECTOS(ProyectoID),

    -- FK 2: VALIDA LA INSCRIPCIÓN (La clave de la integridad)
    -- Asegura que la calificación solo aplica a un par (CursoID, AlumnoID) que existe en MATRICULAS.
    FOREIGN KEY (CursoID, AlumnoID) REFERENCES MATRICULAS(CursoID, AlumnoID)
)
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla CALIFICACIONES creada exitosamente")

✓ Tabla CALIFICACIONES creada exitosamente

================================================================================================

#### VERIFICACIÓN DE TABLAS CREADAS

In [15]:
# Consultamos la tabla sqlite_master que contiene información sobre todas las tablas
# sqlite_master es una tabla especial del sistema que almacena metadatos
# WHERE type='table' filtra solo las tablas (no vistas, índices, etc.)
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")

# fetchall() obtiene todos los resultados de la consulta como una lista de tuplas
tablas = cursor.fetchall()

print("Tablas en la base de datos:")
print("="*40)
# Iteramos sobre cada tabla encontrada
for tabla in tablas:
    # tabla[0] contiene el nombre de la tabla (primera columna del resultado)
    print(f"  • {tabla[0]}")

Tablas en la base de datos:
========================================
  • sqlite_sequence
  • ALUMNOS
  • PROFESORES
  • PROMOCION
  • VERTICALES
  • CAMPUS
  • PROYECTOS
  • CURSO
  • MATRICULAS
  • CURSO_PROFESOR
  • CALIFICACIONES

================================================================================================

#### INSERCIÓN DE DATOS

##### ALUMNOS

In [16]:
alumnos = df_alumnos[["Nombre", "Email"]].drop_duplicates(subset=['Email']).reset_index(drop=True).values.tolist()


cursor.executemany('''
    INSERT INTO ALUMNOS (Nombre, Email)
    VALUES (?, ?)
''', alumnos)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(alumnos)} alumnos insertados correctamente")

✓ 52 alumnos insertados correctamente

##### PROFESORES

In [17]:
profesores = df_claustro[["Nombre", "Rol", "Modalidad"]].drop_duplicates(subset=["Nombre"]).reset_index(drop=True).values.tolist()

cursor.executemany('''
    INSERT INTO PROFESORES (Nombre, Rol, Modalidad)
    VALUES (?, ?, ?)
''', profesores)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(profesores)} profesores insertados correctamente")

✓ 10 profesores insertados correctamente

##### VERTICALES

In [18]:
verticales = df_claustro[["Vertical"]].drop_duplicates().reset_index(drop=True).values.tolist()

cursor.executemany('''
    INSERT INTO VERTICALES (Nombre)
    VALUES (?)
''', verticales)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(verticales)} verticales insertadas correctamente")

✓ 2 verticales insertadas correctamente

##### CAMPUS

In [19]:
campus = df_claustro[["Campus"]].drop_duplicates().reset_index(drop=True).values.tolist()

cursor.executemany('''
    INSERT INTO CAMPUS (Ciudad)
    VALUES (?)
''', campus)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(campus)} campus insertadas correctamente")

✓ 2 campus insertadas correctamente

##### PROMOCIONES

In [20]:
promociones = df_alumnos[["Promoción", "Fecha_comienzo"]].drop_duplicates().reset_index(drop=True).values.tolist()

cursor.executemany('''
    INSERT INTO PROMOCION (Mes, Fecha_comienzo)
    VALUES (?, ?)
''', promociones)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(promociones)} promociones insertados correctamente")

✓ 2 promociones insertados correctamente

##### PROYECTOS

In [21]:
# 1. PASO LOOKUP: Obtener los VerticalID necesarios
# Consultar la BD para obtener los IDs
cursor.execute("SELECT VerticalID FROM VERTICALES WHERE Nombre = 'DS'")
ds_id = cursor.fetchone()[0]

cursor.execute("SELECT VerticalID FROM VERTICALES WHERE Nombre = 'FS'")
fs_id = cursor.fetchone()[0]


# 2. DEFINICIÓN DE PROYECTOS POR VERTICAL
proyectos_ds = df_alumnos.columns[5:10].values.tolist()

proyectos_fs = df_alumnos.columns[10:].values.tolist()


# 3. CREAR LISTA FINAL DE TUPLAS (Nombre, VerticalID)
proyectos_datos = []

# Añadir los 5 proyectos de Data Science
for nombre in proyectos_ds:
    proyectos_datos.append((nombre, ds_id))

# Añadir los 5 proyectos de Full Stack
for nombre in proyectos_fs:
    proyectos_datos.append((nombre, fs_id))

print(f"Preparados para insertar {len(proyectos_datos)} proyectos (10 en total).")

# 4. Ejecutar executemany() para insertar todos los datos
# Usamos INSERT OR IGNORE, ya que el par (Nombre, VerticalID) debe ser único.
cursor.executemany('''
    INSERT OR IGNORE INTO PROYECTOS (Nombre, VerticalID)
    VALUES (?, ?)
''', proyectos_datos)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(proyectos_datos)} proyectos insertados correctamente")

Preparados para insertar 10 proyectos (10 en total).
✓ 10 proyectos insertados correctamente

#### CURSO

In [22]:
# --- INSERCIÓN EN CURSO ---

# 1. PREPARACIÓN: Etiquetar las verticales en los DataFrames
# Asignamos la vertical correspondiente a cada conjunto de datos
df_alumnos_ds['Vertical'] = 'DS'
df_alumnos_fs['Vertical'] = 'FS'

# Consolidamos todos los alumnos en un único DataFrame
df_alumnos_completo = pd.concat([df_alumnos_ds, df_alumnos_fs]).reset_index(drop=True)


# 2. IDENTIFICACIÓN DE INSTANCIAS ÚNICAS DE CURSO
# Extraemos las combinaciones únicas de (Promoción, Campus, Vertical)
df_instancias_curso = df_alumnos_completo[
    ["Promoción", "Fecha_comienzo", "Campus", "Vertical"]
].drop_duplicates().reset_index(drop=True)

print(f"Instancias de curso únicas a crear: {len(df_instancias_curso)}")


# 3. CREAR LISTA DE TUPLAS CON LOS IDs CORRESPONDIENTES
cursos_datos = []

# Iteramos sobre cada instancia única para hacer los lookups necesarios
for index, row in df_instancias_curso.iterrows():
    
    # 3.1 LOOKUP 1: Obtener PromocionID
    sql_promocion = "SELECT PromocionID FROM PROMOCION WHERE Mes = ? AND Fecha_comienzo = ?"
    cursor.execute(sql_promocion, (row['Promoción'], row['Fecha_comienzo']))
    promocion_id = cursor.fetchone()[0]
    
    # 3.2 LOOKUP 2: Obtener VerticalID
    sql_vertical = "SELECT VerticalID FROM VERTICALES WHERE Nombre = ?"
    cursor.execute(sql_vertical, (row['Vertical'],))
    vertical_id = cursor.fetchone()[0]
    
    # 3.3 LOOKUP 3: Obtener CampusID
    sql_campus = "SELECT CampusID FROM CAMPUS WHERE Ciudad = ?"
    cursor.execute(sql_campus, (row['Campus'],))
    campus_id = cursor.fetchone()[0]
    
    # Añadimos la tupla (PromocionID, VerticalID, CampusID) a la lista
    cursos_datos.append((promocion_id, vertical_id, campus_id))


# 4. INSERCIÓN MASIVA EN LA TABLA CURSO
cursor.executemany('''
    INSERT INTO CURSO (PromocionID, VerticalID, CampusID)
    VALUES (?, ?, ?)
''', cursos_datos)

# Guardamos los cambios
conexion.commit()

print(f"✓ {len(cursos_datos)} instancias de CURSO insertadas correctamente")

Instancias de curso únicas a crear: 4
✓ 4 instancias de CURSO insertadas correctamente

In [23]:
# --- CONSULTA DE VERIFICACIÓN: VER LAS INSTANCIAS DE CURSO CREADAS ---

sql_verificacion = """
SELECT
    c.CursoID,
    v.Nombre AS Vertical,
    p.Mes AS Promoción,
    ca.Ciudad AS Campus,
    p.Fecha_comienzo
FROM
    CURSO c
JOIN VERTICALES v ON c.VerticalID = v.VerticalID
JOIN PROMOCION p ON c.PromocionID = p.PromocionID
JOIN CAMPUS ca ON c.CampusID = ca.CampusID
ORDER BY Vertical, Promoción, Campus;
"""

df_cursos_verificacion = pd.read_sql_query(sql_verificacion, conexion)

print("\nInstancias de CURSO creadas:")
print("=" * 60)
display(df_cursos_verificacion)

Instancias de CURSO creadas:
============================================================

   CursoID Vertical   Promoción    Campus Fecha_comienzo
0        2       DS     Febrero    Madrid     12/02/2024
1        1       DS  Septiembre    Madrid     18/09/2023
2        4       FS     Febrero  Valencia     12/02/2024
3        3       FS  Septiembre    Madrid     18/09/2023

#### CURSO_PROFESOR

In [24]:
# --- INSERCIÓN EN CURSO_PROFESOR ---

# 1. PASO LOOKUP: Obtener IDs de la BD para profesores, cursos, verticales y campus.

# Obtener IDs de los profesores
sql_profesores_id = "SELECT ProfesorID, Nombre, Rol, Modalidad FROM PROFESORES"
df_profesores_id = pd.read_sql_query(sql_profesores_id, conexion)

# Obtener IDs de los cursos con sus dimensiones
sql_cursos_dim = """
SELECT
    c.CursoID,
    v.Nombre AS Vertical,
    p.Mes AS Promocion, -- Asume 'Promocion' es el nombre correcto (ajusta si es 'Promoción')
    ca.Ciudad AS Campus
FROM
    CURSO c
JOIN VERTICALES v ON c.VerticalID = v.VerticalID
JOIN PROMOCION p ON c.PromocionID = p.PromocionID
JOIN CAMPUS ca ON c.CampusID = ca.CampusID;
"""
df_cursos_dim = pd.read_sql_query(sql_cursos_dim, conexion)


# 2. COMBINAR DATOS (df_claustro, Cursos, Profesores)

# 2.1. Unir el DataFrame de claustro (df_claustro) con los IDs de los profesores
# Usamos 'Nombre' para la unión. Esto añade el ProfesorID a df_claustro.
df_claustro_con_profid = pd.merge(
    df_claustro,
    df_profesores_id[['ProfesorID', 'Nombre']],
    on='Nombre',
    how='inner'
)
# Renombramos 'Rol' a 'RolEnCurso' para la tabla puente
df_claustro_con_profid = df_claustro_con_profid.rename(columns={'Rol': 'RolEnCurso'})


# 2.2. Unir con la información de los cursos (CursoID)
# Usamos las claves de dimensión: 'Vertical', 'Promocion', 'Campus'
df_curso_profesor_final = pd.merge(
    df_claustro_con_profid,
    df_cursos_dim,
    on=['Vertical', 'Promocion', 'Campus'], # ¡Asegúrate de que 'Promocion' coincide con el nombre real!
    how='inner'
)


# 3. PREPARAR DATOS PARA LA INSERCIÓN
# Seleccionar solo las columnas necesarias para la inserción
datos_curso_profesor = df_curso_profesor_final[[
    "CursoID",
    "ProfesorID",
    "RolEnCurso"
]].drop_duplicates().values.tolist()


print(f"Asignaciones de profesor/curso únicas a crear: {len(datos_curso_profesor)}")

# 4. INSERCIÓN MASIVA EN LA TABLA CURSO_PROFESOR
cursor.executemany('''
    INSERT OR IGNORE INTO CURSO_PROFESOR (CursoID, ProfesorID, RolEnCurso)
    VALUES (?, ?, ?)
''', datos_curso_profesor)

# Guardamos los cambios
conexion.commit()

print(f"✓ {len(datos_curso_profesor)} asignaciones de CURSO_PROFESOR insertadas correctamente")

Asignaciones de profesor/curso únicas a crear: 8
✓ 8 asignaciones de CURSO_PROFESOR insertadas correctamente

#### MATRÍCULAS

In [29]:
# --- INSERCIÓN EN MATRICULAS ---

# 1. PASO LOOKUP: Obtener IDs de la BD para cursos y alumnos.

# 1.1. Obtener IDs de los alumnos (usando Email como clave)
sql_alumnos_id = "SELECT AlumnoID, Email FROM ALUMNOS"
df_alumnos_id = pd.read_sql_query(sql_alumnos_id, conexion)


# 1.2. Obtener IDs de los cursos con sus dimensiones (Vertical, Promocion, Campus)
# IMPORTANTE: Observa que la columna que viene de la BD (p.Mes) debe coincidir
# con la que usas en el DataFrame (df_alumnos_completo).
# Asumo que en la BD se guarda como 'Promocion' (sin tilde), que es lo que SQL devuelve.
sql_cursos_dim = """
SELECT
    c.CursoID,
    v.Nombre AS Vertical,
    p.Mes AS PromocionBD, -- Renombro a PromocionBD para evitar conflictos
    ca.Ciudad AS Campus,
    p.Fecha_comienzo
FROM
    CURSO c
JOIN VERTICALES v ON c.VerticalID = v.VerticalID
JOIN PROMOCION p ON c.PromocionID = p.PromocionID
JOIN CAMPUS ca ON c.CampusID = ca.CampusID;
"""
df_cursos_dim = pd.read_sql_query(sql_cursos_dim, conexion)


# 2. COMBINAR DATOS (df_alumnos_completo, Cursos, Alumnos)

# 2.1. Preparar df_alumnos_completo para el merge
# *** CORRECCIÓN CLAVE AQUÍ: Usamos 'Promoción' (con tilde) para el DataFrame. ***
df_alumnos_merge = df_alumnos_completo[[
    'Email', 
    'Vertical', 
    'Promoción', # <-- CORREGIDO: Usar 'Promoción' para leer el DataFrame
    'Campus', 
    'Fecha_comienzo'
]].drop_duplicates().reset_index(drop=True)

# 2.1.1. NORMALIZACIÓN: Renombramos la columna del DataFrame para que coincida con la BD (si se guarda sin tilde)
# Asumo que el valor del mes de promoción en tu df_alumnos_completo ('Septiembre', 'Febrero') es idéntico a lo que está en PROMOCION.Mes.
df_alumnos_merge = df_alumnos_merge.rename(columns={'Promoción': 'PromocionBD'}) 

# 2.2. Unir el DataFrame de alumnos con sus IDs
df_matriculas_base = pd.merge(
    df_alumnos_merge,
    df_alumnos_id,
    on='Email',
    how='inner'
)


# 2.3. Unir con la información de los cursos (CursoID)
# Usamos la columna PromocionBD (que ahora tiene los datos del df_alumnos_completo)
df_matriculas_final = pd.merge(
    df_matriculas_base,
    df_cursos_dim[['CursoID', 'Vertical', 'PromocionBD', 'Campus']],
    on=['Vertical', 'PromocionBD', 'Campus'], # <-- Usamos PromocionBD para la unión
    how='inner'
)

# 3. PREPARAR DATOS PARA LA INSERCIÓN

# La fecha de inscripción se toma como la Fecha_comienzo de la promoción
df_matriculas_final['FechaInscripcion'] = df_matriculas_final['Fecha_comienzo']

# Seleccionar solo las columnas necesarias: (CursoID, AlumnoID, FechaInscripcion)
datos_matriculas = df_matriculas_final[[
    "CursoID",
    "AlumnoID",
    "FechaInscripcion"
]].drop_duplicates().values.tolist()


print(f"Matrículas únicas a crear: {len(datos_matriculas)}")

# 4. INSERCIÓN MASIVA EN LA TABLA MATRICULAS
cursor.executemany('''
    INSERT OR IGNORE INTO MATRICULAS (CursoID, AlumnoID, FechaInscripcion)
    VALUES (?, ?, ?)
''', datos_matriculas)

# Guardamos los cambios
conexion.commit()

print(f"✓ {len(datos_matriculas)} matrículas insertadas correctamente")

# --- CONSULTA DE VERIFICACIÓN (Opcional) ---
sql_verificacion_mat = """
SELECT
    m.CursoID,
    a.Nombre AS Alumno,
    v.Nombre AS Vertical,
    p.Mes AS Promoción,
    ca.Ciudad AS Campus,
    m.FechaInscripcion
FROM
    MATRICULAS m
JOIN CURSO c ON m.CursoID = c.CursoID
JOIN ALUMNOS a ON m.AlumnoID = a.AlumnoID
JOIN VERTICALES v ON c.VerticalID = v.VerticalID
JOIN PROMOCION p ON c.PromocionID = p.PromocionID
JOIN CAMPUS ca ON c.CampusID = ca.CampusID
ORDER BY a.Nombre, v.Nombre;
"""

df_matriculas_verificacion = pd.read_sql_query(sql_verificacion_mat, conexion)

print("\nMatrículas creadas (primeras 5):")
print("=" * 70)
display(df_matriculas_verificacion.head())

Matrículas únicas a crear: 52
✓ 52 matrículas insertadas correctamente

Matrículas creadas (primeras 5):
======================================================================

,CursoID,Alumno,Vertical,Promoción,Campus,FechaInscripcion
0,1,Abraham Vélez,DS,Septiembre,Madrid,18/09/2023
1,3,Aitana Sebastián,FS,Septiembre,Madrid,18/09/2023
2,3,Albino Macias,FS,Septiembre,Madrid,18/09/2023
3,4,Alejandra Vilaplana,FS,Febrero,Valencia,12/02/2024
4,3,Amor Larrañaga,FS,Septiembre,Madrid,18/09/2023

#### CALIFICACIONES

In [30]:
# --- INSERCIÓN EN CALIFICACIONES ---
from datetime import datetime

# 1. PREPROCESAMIENTO: Mapear notas y despivotar el DataFrame de alumnos

# Definimos el mapeo de "Apto" / "No Apto" a valores numéricos (0 y 1)
mapeo_notas = {'Apto': 1, 'No Apto': 0}

# Identificar las columnas de proyectos en df_alumnos_completo
columnas_proyecto = [col for col in df_alumnos_completo.columns if col.startswith('Proyecto_')]

# Hacemos un 'unpivot' (melt) para tener una fila por cada calificación (Alumno, Curso, Proyecto, Nota)
# *** CLAVE: Usamos 'Promoción' (con tilde) para acceder a la columna del DataFrame ***
df_calificaciones_melt = df_alumnos_completo.melt(
    id_vars=['Email', 'Promoción', 'Campus', 'Vertical'], 
    value_vars=columnas_proyecto,
    var_name='NombreProyecto',
    value_name='Nota_Literal'
)

# 1.1 Limpiar y transformar
# Eliminar las filas donde no hay nota (NaN)
df_calificaciones_melt.dropna(subset=['Nota_Literal'], inplace=True)

# Convertir la nota literal a numérica usando el mapa
df_calificaciones_melt['Nota'] = df_calificaciones_melt['Nota_Literal'].map(mapeo_notas)

# Normalizar el nombre de la columna Promoción para el merge con la BD
df_calificaciones_melt = df_calificaciones_melt.rename(columns={'Promoción': 'PromocionBD'})

# 2. LOOKUP Y COMBINACIÓN DE IDs

# 2.1. Obtener todos los IDs de Proyectos
sql_proyectos = "SELECT ProyectoID, Nombre FROM PROYECTOS"
df_proyectos_bd = pd.read_sql_query(sql_proyectos, conexion)

# 2.2. Obtener el AlumnoID y CursoID desde la tabla MATRICULAS (que ya contiene los vínculos correctos)
# Reutilizamos la lógica del lookup de MATRICULAS para obtener la clave de curso/alumno
sql_matriculas_lookup = """
SELECT
    m.CursoID,
    m.AlumnoID,
    a.Email,
    v.Nombre AS Vertical,
    p.Mes AS PromocionBD,
    ca.Ciudad AS Campus
FROM
    MATRICULAS m
JOIN CURSO c ON m.CursoID = c.CursoID
JOIN ALUMNOS a ON m.AlumnoID = a.AlumnoID
JOIN VERTICALES v ON c.VerticalID = v.VerticalID
JOIN PROMOCION p ON c.PromocionID = p.PromocionID
JOIN CAMPUS ca ON c.CampusID = ca.CampusID;
"""
df_matriculas_lookup = pd.read_sql_query(sql_matriculas_lookup, conexion)


# 2.3. Unir las Calificaciones (melted) con los IDs de Matrículas
# Clave de unión: Email, Vertical, PromocionBD, Campus
df_calificaciones_con_ids = pd.merge(
    df_calificaciones_melt,
    df_matriculas_lookup[['CursoID', 'AlumnoID', 'Email', 'Vertical', 'PromocionBD', 'Campus']],
    on=['Email', 'Vertical', 'PromocionBD', 'Campus'],
    how='inner'
)


# 2.4. Unir con los IDs de Proyectos
# Clave de unión: NombreProyecto (del melt) con Nombre (de la tabla PROYECTOS)
df_calificaciones_final = pd.merge(
    df_calificaciones_con_ids,
    df_proyectos_bd,
    left_on='NombreProyecto',
    right_on='Nombre',
    how='inner'
)

# 3. PREPARAR DATOS PARA LA INSERCIÓN

# Añadimos una fecha de evaluación simulada
fecha_evaluacion = datetime.now().strftime('%Y-%m-%d')
df_calificaciones_final['FechaEvaluacion'] = fecha_evaluacion


# Seleccionar las columnas para la inserción: (CursoID, AlumnoID, ProyectoID, Nota, FechaEvaluacion)
datos_calificaciones = df_calificaciones_final[[
    "CursoID",
    "AlumnoID",
    "ProyectoID",
    "Nota",
    "FechaEvaluacion"
]].drop_duplicates().values.tolist()


print(f"Calificaciones únicas a crear: {len(datos_calificaciones)}")

# 4. INSERCIÓN MASIVA EN LA TABLA CALIFICACIONES
cursor.executemany('''
    INSERT OR IGNORE INTO CALIFICACIONES (CursoID, AlumnoID, ProyectoID, Nota, FechaEvaluacion)
    VALUES (?, ?, ?, ?, ?)
''', datos_calificaciones)

# Guardamos los cambios
conexion.commit()

print(f"✓ {len(datos_calificaciones)} calificaciones insertadas correctamente")

# --- CONSULTA DE VERIFICACIÓN (Opcional) ---
sql_verificacion_cal = """
SELECT
    c.CursoID,
    a.Nombre AS Alumno,
    pr.Nombre AS Proyecto,
    cal.Nota
FROM
    CALIFICACIONES cal
JOIN ALUMNOS a ON cal.AlumnoID = a.AlumnoID
JOIN PROYECTOS pr ON cal.ProyectoID = pr.ProyectoID
JOIN CURSO c ON cal.CursoID = c.CursoID
ORDER BY Alumno, Proyecto
LIMIT 10;
"""

df_calificaciones_verificacion = pd.read_sql_query(sql_verificacion_cal, conexion)

print("\nCalificaciones creadas (primeras 10):")
print("=" * 70)
display(df_calificaciones_verificacion)

Calificaciones únicas a crear: 260
✓ 260 calificaciones insertadas correctamente

Calificaciones creadas (primeras 10):
======================================================================

   CursoID            Alumno             Proyecto Nota
0        1     Abraham Vélez        Proyecto_BBDD    0
1        1     Abraham Vélez  Proyecto_Deployment    1
2        1     Abraham Vélez         Proyecto_EDA    0
3        1     Abraham Vélez         Proyecto_HLF    1
4        1     Abraham Vélez          Proyecto_ML    1
5        3  Aitana Sebastián     Proyecto_Backend    1
6        3  Aitana Sebastián    Proyecto_FrontEnd    0
7        3  Aitana Sebastián   Proyecto_FullSatck    1
8        3  Aitana Sebastián       Proyecto_React    0
9        3  Aitana Sebastián      Proyecto_WebDev    1

================================================================================================

#### CONSULTAS DE COMPROBACIÓN

In [41]:
# Consulta 1:
print("Calificaciones de Leoncio Tena")

sql_q1 = """
SELECT
    ALUMNOS.Nombre AS Alumno,
    PROYECTOS.Nombre AS Proyecto,
    CALIFICACIONES.Nota AS Nota_Numerica
FROM
    ALUMNOS
JOIN CALIFICACIONES ON ALUMNOS.AlumnoID = CALIFICACIONES.AlumnoID
JOIN PROYECTOS ON CALIFICACIONES.ProyectoID = PROYECTOS.ProyectoID
WHERE
    ALUMNOS.Nombre = 'Leoncio Tena'
ORDER BY
    PROYECTOS.Nombre;
"""

df_q1 = pd.read_sql_query(sql_q1, conexion)
display(df_q1)

Calificaciones de Leoncio Tena

         Alumno             Proyecto Nota_Numerica
0  Leoncio Tena        Proyecto_BBDD             1
1  Leoncio Tena  Proyecto_Deployment             1
2  Leoncio Tena         Proyecto_EDA             1
3  Leoncio Tena         Proyecto_HLF             1
4  Leoncio Tena          Proyecto_ML             1

In [38]:
# Consulta 2:
print("Cursos Asignados a Mario Prats")

sql_q2 = """
SELECT
    PROFESORES.Nombre AS Profesor,
    CURSO_PROFESOR.RolEnCurso AS Rol,
    VERTICALES.Nombre AS Vertical,
    PROMOCION.Mes AS Promocion,
    CAMPUS.Ciudad AS Campus
FROM
    PROFESORES
JOIN CURSO_PROFESOR ON PROFESORES.ProfesorID = CURSO_PROFESOR.ProfesorID
JOIN CURSO ON CURSO_PROFESOR.CursoID = CURSO.CursoID
JOIN VERTICALES ON CURSO.VerticalID = VERTICALES.VerticalID
JOIN PROMOCION ON CURSO.PromocionID = PROMOCION.PromocionID
JOIN CAMPUS ON CURSO.CampusID = CAMPUS.CampusID
WHERE
    PROFESORES.Nombre = 'Mario Prats';
"""

df_q2 = pd.read_sql_query(sql_q2, conexion)
display(df_q2)

Cursos Asignados a Mario Prats

      Profesor Rol Vertical Promocion    Campus
0  Mario Prats  LI       FS   Febrero  Valencia

In [39]:
# Consulta 3
print("Alumnos del curso DS Septiembre Madrid")

sql_q3 = """
SELECT
    ALUMNOS.Nombre AS Alumno
FROM
    ALUMNOS
JOIN MATRICULAS ON ALUMNOS.AlumnoID = MATRICULAS.AlumnoID
JOIN CURSO ON MATRICULAS.CursoID = CURSO.CursoID
JOIN VERTICALES ON CURSO.VerticalID = VERTICALES.VerticalID
JOIN PROMOCION ON CURSO.PromocionID = PROMOCION.PromocionID
JOIN CAMPUS ON CURSO.CampusID = CAMPUS.CampusID
WHERE
    VERTICALES.Nombre = 'DS'
    AND PROMOCION.Mes = 'Septiembre'
    AND CAMPUS.Ciudad = 'Madrid'
ORDER BY
    ALUMNOS.Nombre;
"""

df_q3 = pd.read_sql_query(sql_q3, conexion)
display(df_q3)

Alumnos del curso DS Septiembre Madrid

                  Alumno
0          Abraham Vélez
1          Anita Heredia
2      Clementina Santos
3          Daniela Falcó
4       Eduardo Caparrós
5              Eli Casas
6     Ignacio Goicoechea
7           Jafet Casals
8       Jorge Manzanares
9           Leoncio Tena
10  Maximiliano Menéndez
11          Merche Prada
12       Odalys Torrijos
13         Onofre Adadia
14          Pilar Abella

In [40]:
# Consulta 4
print("Cantidad de Alumnos Aprobados en Proyecto_ML")

sql_q4 = """
SELECT
    PROYECTOS.Nombre AS Proyecto,
    COUNT(CALIFICACIONES.Nota) AS Total_Aprobados
FROM
    CALIFICACIONES
JOIN PROYECTOS ON CALIFICACIONES.ProyectoID = PROYECTOS.ProyectoID
WHERE
    PROYECTOS.Nombre = 'Proyecto_ML' AND CALIFICACIONES.Nota = 1 -- Filtro directo
GROUP BY
    PROYECTOS.Nombre;
"""

df_q4 = pd.read_sql_query(sql_q4, conexion)
display(df_q4)

Cantidad de Alumnos Aprobados en Proyecto_ML

      Proyecto  Total_Aprobados
0  Proyecto_ML               22

In [42]:
# Consulta 5:
print("Asignación de Profesores a Cursos")

sql_q5 = """
SELECT
    PROFESORES.Nombre AS Profesor,
    VERTICALES.Nombre AS Vertical,
    PROMOCION.Mes AS Promocion,
    CAMPUS.Ciudad AS Campus,
    CURSO_PROFESOR.RolEnCurso AS Rol
FROM
    PROFESORES
JOIN CURSO_PROFESOR ON PROFESORES.ProfesorID = CURSO_PROFESOR.ProfesorID
JOIN CURSO ON CURSO_PROFESOR.CursoID = CURSO.CursoID
JOIN VERTICALES ON CURSO.VerticalID = VERTICALES.VerticalID
JOIN PROMOCION ON CURSO.PromocionID = PROMOCION.PromocionID
JOIN CAMPUS ON CURSO.CampusID = CAMPUS.CampusID
ORDER BY
    PROFESORES.Nombre, Verticales.Nombre, Promocion.Mes
"""

df_q5 = pd.read_sql_query(sql_q5, conexion)
display(df_q5)

Asignación de Profesores a Cursos

             Profesor Vertical   Promocion    Campus Rol
0    Ana Sofía Ferrer       FS     Febrero  Valencia  TA
1          Anna Feliu       FS  Septiembre    Madrid  TA
2         Ariel Lledó       DS  Septiembre    Madrid  TA
3   Luis Ángel Suárez       FS  Septiembre    Madrid  LI
4         Mario Prats       FS     Febrero  Valencia  LI
5  María Dolores Diaz       DS  Septiembre    Madrid  LI
6           Noa Yáñez       DS  Septiembre    Madrid  TA
7   Saturnina Benitez       DS  Septiembre    Madrid  TA